[{"type": "text", "content": "The economic situation \n8 Policy rate cut by 0.25 percentage points to 3.25 per cent The Riksbank has gradually eased monetary policy as the inflation outlook has brightened. The policy rate was cut in May and August, at the same time as the Riksbank communicated that further cuts could be expected during the remainder of the year.  The interest rate cuts have contributed to lower interest rates for households and companies. Since the beginning of the year, the variable mortgage rates charged to households have fallen around as much as the policy rate. Mortgage rates with longer maturities have fallen more than variable ones, which largely reflects expectations of a lower policy rate going forward. Companies are also facing a lower lending rate than in the spring. It is important that rate cuts also continue to have the expected impact on other interest rates in the economy and the Riksbank is following developments closely. Conditions are right for a recovery in the Swedish economy but it looks like it will take slightly longer than expected. Monetary policy has contributed to inflation now being close to the target. Low and stable inflation and falling interest rates improve households’ finances and make it easier for companies to invest. Despite an expec-tation among economic agents of better times ahead, there are few clear signs as yet of a recovery in the Swedish economy. It is important in itself that economic activity strengthens soon, but it is also a necessary condition for inflation to stabilise around the target.  Over the year, inflation has shown increasing signs of stabilising around two per cent. In addition, the risk of excessive inflation has gradually decreased. Unusually low energy prices are expected to lead to CPIF inflation being below two per cent for a few months more before stabilising around the target over the course of next year. However, the development of energy prices is highly uncertain and may lead to CPIF inflation becoming higher or lower than forecast.3 It is assessed that the policy rate can be cut at a faster pace than previously communicated. The Executive Board has decided to cut the policy rate by 0.25 per-centage points to 3.25 per cent. If the outlook for inflation and economic activity remains unchanged, the policy rate may also be cut at the two remaining meetings this year. The forecast for the policy rate reflects that a cut of 0.5 percentage points at one of the coming meetings is possible. It also indicates that one or two further cuts may be made during the first half of 2025 (see Figure 1).", "page_number": 1}, {"type": "text", "content": "Together, these changes imply a relatively large shift of monetary policy in a more expansionary direction, which will improve households’ finances and make it easier for companies to invest. However, the starting point will still be that monetary policy is adjusted gradually.4  \n 3 See also the Fact box “The CPIF under alternative assumptions for energy prices”. 4 See the Fact box “The policy rate is often adjusted gradually”.", "page_number": 1}, {"type": "text", "content": "The economic situation \n9 Figure 1. Swedish policy rate and inflation Per cent and annual percentage change respectively (lower right) \n  \n Note. Solid line refers to outcome, dashed/dotted lines represent the Riksbank’s forecast. Outcomes for the policy rate are daily data and the forecasts refer to quarterly averages. The upper image shows the forecast for the policy rate in the short run and is based on the long-term policy rate path in the lower left figure. The dotted line marks the high uncertainty surrounding the forecast for the policy rate in the long term, which is discussed in chapter 3. The inflation forecast is assessed to be compatible with the forecast for the policy rate. Sources: Statistics Sweden and the Riksbank.", "page_number": 2}, {"type": "text", "content": "The economic situation \n10 Forecast for the policy rate  The forecast for the policy rate shows the development during the forecast period that is considered compatible with the other forecasts, including the expected development of inflation. The Riksbank reports the policy rate forecast over two time horizons. The aim of this is to clarify that the forecasts for the policy rate become more uncertain as they move further into the future.  The upper image in Figure 1 shows the Executive Board’s assessment of the policy rate in the coming three quarters. The forecasts for economic developments in the short term are based on further information and are thus usually less uncertain than longer range forecasts. The Executive Board can therefore predict the more imminent monetary policy decisions with somewhat greater accuracy, even though these forecasts are also uncertain.  The lower left image in Figure 1 shows the policy rate path over the entire forecast period. The forecasts for the policy rate further ahead become more uncertain as the probability of new shocks hitting the economy increases over time. The dotted line emphasises this uncertainty.", "page_number": 3}, {"type": "text", "content": "The economic situation \n11 1 The economic situation Inflation has continued to fall abroad even though services prices are still increasing at a relatively fast pace. Many central banks, including the ECB and Federal Reserve, have cut their policy rates once or several times and more cuts are expected. GDP in the euro area increased during the first half of 2024, after remaining in principle unchanged since the end of 2022. In the United States, GDP has long been strong, but there are now signs of a slowdown and unemployment has risen.  In Sweden, CPIF inflation was 1.2 per cent in August due to low energy prices. Measured in terms of the CPIF excluding energy, inflation was 2.2 per cent. Companies’ pricing plans and long-term inflation expec-tations indicate that inflation will remain close to 2 per cent going for-ward. Swedish GDP decreased slightly in the second quarter and the labour market is weaker than normal, although indicators suggest that the downturn is close to bottoming out.  The transmission of the Riksbank’s monetary policy to the interest rates faced by households and companies is considered to be working well. Deposit and lending rates have continued to fall at the same pace as the Riksbank has cut the policy rate and we are following developments closely.  1.1 Real economy and inflation abroad Strong growth in United States, weaker in euro area  After remaining in principle unchanged since the end of 2022, euro area GDP has grown during the first half of this year. During the second quarter, GDP rose by 0.2 per cent compared with the first quarter (see Figure 3). Both household consumption and in particular gross fixed investment declined, however, and growth was primarily driven by a positive net export. Growth in the euro area differs substantially between countries; for instance GDP fell somewhat in Germany during the second quarter, while it rose fairly significantly in Spain. Indicators for the business sector give a mixed impression, with the purchasing managers’ index in the services sector indicating growth, although marginally, while it looks weaker in the manufacturing sector (see Figure 3). So far, consumption growth has been weak in many countries, but rising real incomes indicate slightly stronger consumption and growth going forward.", "page_number": 4}, {"type": "text", "content": "The economic situation \n12 In the United States, GDP rose more than expected in the second quarter, by 0.7 per cent compared with the first quarter of this year. Growth was partly due to a con-tinued strong outcome in household consumption (see Figure 3). In July, too, house-hold consumption remained strong, but the purchasing managers’ index, for example, suggests weaker development going forward (see Figure 3).  Growth in China was marginally lower than expected during the second quarter, which is largely explained by weak domestic demand. Indicators such as the purchas-ing managers’ index and in particular consumer confidence indicate that domestic demand will be weak.  Figure 2. GDP and consumption abroad Index, 2019 Q4 = 100 \n Note. Seasonally-adjusted and calendar-adjusted data. Sources: Eurostat, Statistics Sweden and the US Bureau of Economic Analysis.", "page_number": 5}, {"type": "text", "content": "The economic situation \n13 Figure 3. Purchasing managers’ index in the service sector and manufacturing sector Index \n  Note. The purchasing managers’ index is an indicator of economic activity where an index figure above 50 indicates growth, while a figure below 50 indicates a downturn. Sources: Institute for Supply Management, S&P Global and Swedbank. Labour market starting to weaken in United States In the euro area, unemployment is still low and the employment rate is rising (see Figure 4) despite a period of relatively weak growth and companies’ recruitment plans having fallen since last winter. The weakening in the labour market in the United States has become clearer recently. The increase in employment according to Nonfarm Payrolls has slowed down significantly, and US unemployment has risen over the past year, although it fell marginally in August to 4.2 per cent. Moreover, new recruitments and voluntary redundancies have fallen to a low level. In a longer term perspective, however, unemployment in the United States can still be regarded as low.", "page_number": 6}, {"type": "text", "content": "The economic situation \n14 Figure 4. Unemployment and the employment rate abroad Percentage of the labour force (left) and percentage of the population (right) \n Note. Seasonally adjusted data. Unemployment and the employment rate among those aged 15–74 in Sweden and the euro area, and those aged 16 and older for the United States. Sources: Eurostat, Statistics Sweden and the US Bureau of Labor Statistics. Inflation is on the way down but inflation in service prices is still high In August, HICP inflation in the euro area fell to 2.2 per cent. The downturn can largely be explained by a lower rate of increase in energy prices (see Figure 5). Since the end of last year, the annual rate of increase for services prices has been at around 4 per cent, which is substantially higher than normal (see Figure 6).5 Agreed wage increases in the euro area slowed down during the second quarter but, in several countries, wages are still rising at a relatively rapid pace, which contributes to maintaining the rate of increase in service prices. This includes Germany.  In the United States, CPI inflation has continued to fall and was 2.5 per cent in August. One reason for this is the lower rate of increase for energy prices, as well as the slower increase of services prices excluding rents and energy in recent months at the same time as the rate of increase in prices for goods has remained low. Moreover, other prices are now increasing at a more moderate pace. In terms of the PCE, inflation was 2.5 per cent in July.6 US wage growth has slowed down over the last year. In addition, commodity prices have fallen on the world market and inflation expectations have slowed down in both the euro area and United States. This suggests lower inflationary pressures in the period ahead.  \n 5 The average annual change in services prices since January 2000 is 2.1 per cent in the euro area, 3.0 per cent in the United States and 2.3 per cent in Sweden.  6 PCE is the Federal Reserve’s preferred measure of inflation. Rents have a lower weighting in this measure than in the CPI. See the fact box “The difference between the measures CPI and PCE in the United States” in the Monetary Policy Report March 2024, Sveriges Riksbank, for a description of the differences between the CPI and PCE measures.", "page_number": 7}, {"type": "text", "content": "The economic situation \n15 Figure 5. Consumer prices in various countries and regions Annual percentage change \n Note. Refers to the CPIF for Sweden, the HICP for the euro area and the CPI for the United States. Sources: Statistics Sweden, Eurostat and US Bureau of Labor Statistics. Figure 6. Prices of goods and services abroad Annual percentage change \n Note. Refers to the CPIF for Sweden, the HICP for the euro area and the CPI for the United States. Sources: Eurostat, Statistics Sweden, US Bureau of Labor Statistics and the Riksbank.", "page_number": 8}, {"type": "text", "content": "The economic situation \n16 1.2 Financial conditions ECB and Federal Reserve cut their policy rates in September  Following the rapid increases in policy rates, most central banks around the world are in a situation where they are now gradually easing their monetary policy, even if interest rate levels are still contractionary (see Figure 7). On 12 September, the ECB cut its deposit rate by 0.25 percentage points, to 3.5 per cent.7 The ECB emphasises that it is unwilling to commit to a certain interest rate path in advance and that interest rate decisions will be taken on a meeting by meeting basis.  The Federal Reserve cut its policy rate on 18 September for the first time since March 2020. At its meeting, the target interval for the Federal funds rate was cut by 0.5 per-centage points to 4.75-5.00 per cent. The central bank communicated that the upside risks for inflation have declined and that the downside risks for the labour market have increased, and that it is therefore appropriate to begin easing monetary policy to avoid an overly weak economic development. The Federal Reserve emphasises that they are not following a predetermined interest rate path, but will take decisions one meeting at a time. The FOMC members’ own assessments of the future policy rate, illustrated by the ‘dot-plot’, were lowered for 2024 and 2025 and indicate a policy rate of 4.4 per cent before the end of the year and 3.4 per cent at the end of 2025.8  Figure 7. International policy rates  Per cent \n Sources: National central banks and the Riksbank.  \n 7 The ECB also cut the interest rate for its lending facility and the interest rate for its main refinancing operations. See ECB monetary policy decision, 12 September 2024. 8 Refers to the mid-point for the policy rate interval. See FOMC Projections material, September 2024, Federal Open Market Committee, Federal Reserve.", "page_number": 9}, {"type": "text", "content": "The economic situation \n17 Market expectations of international policy rates have fallen again  At the beginning of the year, there were widespread expectations that central banks abroad would cut their policy rates several times over the year. During the spring, these expectations were reversed, largely due to surprisingly high inflation outcomes and stronger economic activity. Over the summer, market expectations have shifted down again apace with clearer signs of lower inflation outcomes and economic slow-down. The expectations of the Federal Reserve’s monetary policy have varied substantially, with market pricing having shifted several times in response to new economic outcomes. According to the pricing of futures contracts for short-term money market rates, market participants expect the Federal Reserve to cut the policy rate by around 1.7 percentage points until the middle of next year. For the ECB, expectations of rate cuts are somewhat lower. The ECB is expected to cut the deposit rate by around 1.3 percentage points over the same time period (see Figure 8). Figure 8. Market expectations of policy rates in the future  Per cent \n Note. The figure shows policy rates and market-based expectations according to forward pricing (Nelson-Siegel (1994)). Solid lines represent expectations on 23 September 2024. Dashed lines represent expectations immediately prior to the Monetary Policy Update in August. Sources: National central banks and the Riksbank. Market rates at both short and longer maturities have fallen slightly  Since the Monetary Policy Update in August, both short and long-term government bond yields and yields on higher-risk bonds have fallen slightly in Sweden, the euro area and the United States (see Figure 9). In the euro area and United States, the yield spread between risky bonds and swap rates increased temporarily in conjunction with the financial turbulence at the start of August.9 Even though monetary policy remains  9 Risky bonds refers to covered bonds, municipal bonds and corporate bonds, for example.", "page_number": 10}, {"type": "text", "content": "The economic situation \n18 contractionary, the shrinking yield spreads are making it easier for banks and compa-nies, for example, to obtain funding on the market. The global financial conditions can change rapidly, however. One example of this was the market turbulence observed at the beginning of August, when for instance yen-financed carry-trades were rapidly settled. Figure 9. Government bond yields and stock market movements in Sweden, the euro area and US Per cent (left) and index, 27 June 2024 = 100 (right) \n Note. The left-hand figure refers to zero coupon rates for Sweden and Germany, as well as benchmark rates for the United States.  Sources: Macrobond and the Riksbank.  Stock markets have also continued to develop strongly and have recovered from the downturn at the start of August (see Figure 9). Measured using the VIX index for the United States and Germany, volatility on the stock market is lower today, overall, than it was during the summer. Indicators measuring financial stress on the markets are also at low levels.  Lower lending and deposit rates for households and companies As the Riksbank has cut its policy rate, the interest rates faced by households and companies have also fallen. Since the start of the year, the average mortgage rate on new loans has fallen by about as much as the Riksbank has so far cut the policy rate (see Figure 10).10 For mortgage rates on loans with a longer maturity that also include expectations of lower interest rates going forward, mortgage rates have fallen more than the policy rate, however (see Figure 11). For instance, the average rate on new mortgages with a fixed interest period of between one and three years has fallen by around one percentage point since the beginning of 2024. In the corporate sector too,  10 Based on Statistics Sweden's financial market statistics until the end of July and the banks’ published average interest rates in August.", "page_number": 11}, {"type": "text", "content": "The economic situation \n19 all industries are facing a lower interest rate on their outstanding bank loans (see Figure 10).  The deposit rate has also fallen, although not by as much as the average lending rates. When the policy rate is cut, deposit rates usually fall by less than lending rates. This is partly because competition for deposits is relatively high, not least from other finan-cial instruments in which depositors can invest their liquidity. The transmission from the policy rate to the interest rates met by households and companies is following historical patterns and working well.  Figure 10. Average lending and deposit rates to households and companies and the Riksbank’s policy rate Per cent \n Note. Volume-weighted averages of lending and deposit rates at all maturities. For households, this refers to interest rates on loans from monetary financial institutions, housing credit institu-tions and alternative investment funds. Household lending rate refers to loans for housing purposes. For companies, this refers to loans from monetary financial institutions. New loans also includes renegotiated loans. The last outcome refers to July 2024.  Sources: Statistics Sweden and the Riksbank.", "page_number": 12}, {"type": "text", "content": "The economic situation \n20 Figure 11. Average mortgage rates to households for various fixed terms Per cent \n Note. Refers to mortgage rates from monetary financial institutions, housing credit institutions and alternative investment funds. Solid lines represent new and renegotiated loans, dashed lines represent outstanding loans. The last outcome refers to July 2024. Source: Statistics Sweden. Credit growth remains on low levels and housing prices are rising slowly Despite the slightly lower lending rates, lending to households and companies remains on low levels. It is still negative for companies (see Figure 12).11 Companies within all sectors, except for the categories “property sector – housing” and “other services”, which are cutting their borrowing.  Since the start of the year, housing prices have risen by about 2.5 per cent. Housing prices are now on about the same level as before the pandemic. Even though turn-over on the housing market has started to recover slightly, the supply of housing has continued to increase during the year. The large supply in relation to turnover may have a restraining effect on housing prices.  \n 11 Corporate borrowing can take place via bank loans or by the issuance of securities on the bond market. Even if total credit growth is negative, there are some signs that lending via the bond market in Swedish kronor is increasing slightly due to increased risk appetite and lower risk premiums.", "page_number": 13}, {"type": "text", "content": "The economic situation \n21 Figure 12. Household and corporate borrowing Annual percentage change \n Note. Lending by monetary financial institutions (MFIs) to households and non-financial corporations adjusted for reclassifications and bought and sold loans. Securities issued by non-financial companies have been adjusted for currency impact. Loans from MFIs constitute about two thirds of total lending to companies, while securities issues constitute around a third. Source: Statistics Sweden. Lower interest rates in the United States are supporting the appreciation of smaller currencies The market has continued to adjust its expectations of the development of interest rates in the United States downwards. This has contributed to the further deprecia-tion of the dollar and has supported smaller currencies, such as the Swedish krona. Overall, the krona has developed in line with other small currencies and, measured in terms of the KIX, the krona is at around the same level as the Monetary Policy Update in August (see Figure 13). In the Riksbank’s forecast, the krona is assumed to strengthen in the period ahead.", "page_number": 14}, {"type": "text", "content": "The economic situation \n22 Figure 13. Development of a number of smaller currencies against the dollar plus nominal exchange rate against KIX4  Index, 1 January 2024 = 100  \n Note. A higher value indicates a weaker exchange rate. The KIX4 (krona index) is a weighted average against the US dollar, euro, pound sterling and Norwegian krone. The dashed vertical lines mark the date of the Monetary Policy Update in August and the solid vertical lines mark the date of the Monetary Policy Report in June. Sources: Macrobond Financial AB and the Riksbank. 1.3 Swedish real economy Swedish consumption remains weak Swedish GDP decreased by 0.3 per cent during the second quarter of the year, com-pared with the previous quarter (see Figure 3). The downturn can largely be explained by weak consumption and investment, while the greatest positive contribution came from net exports. The household savings ratio has been high and consumption has been restrained since interest rates started to be raised in 2022 (see Figure 14).12  \n 12 See also “Households continued saving at the same time as the growth rate for mortgages increased”, Financial accounts, second quarter 2024, Statistics Sweden.", "page_number": 15}, {"type": "text", "content": "The economic situation \n23 Figure 14. Household savings ratio Percentage of disposable income \n Note. Seasonally adjusted data. Households and non-profit institutions serving households (NPISH).  Sources: Statistics Sweden and the Riksbank. The National Institute of Economic Research’s Economic Tendency Survey fell margin-ally in August and overall contributes to the view of slightly weaker development than the Riksbank expected in its June forecast. However, there remain signs of future optimism among households. For example, their assessment of Sweden’s economy and their own economies in 12 months is higher than normal. Continuing weak labour market  Unemployment has risen since the end of 2022 (see Figure 4). The low demand in the economy and labour market indicators all point to the continuing relatively weak development of the labour market in the near term. The number of redundancy notices and bankruptcies is on an elevated level and the number of newly-registered vacancies has fallen significantly. On the other hand, recruitment plans are weakly positive, with the service sector in particular planning new recruitment.  Recession close to bottom Resource utilisation in the Swedish economy is currently assessed to be somewhat lower than normal and the economy is in mild recession. One way of estimating resource utilisation is to assess the size of the gap between actual and potential levels for GDP, for example, known as the GDP gap. Another indicator of resource utilisation is the view taken by companies of the current demand situation, which is measured regularly by the National Institute of Economic Research. The Riksbank's assessment is that the GDP gap is lower than normal, which corresponds well to the current demand situation (see Figure 15). The Riksbank’s resource utilisation indicator, the RU indica-tor, which weighs together various indicators, also suggests that resource utilisation has fallen and is marginally below normal. But indicators for growth have risen since the start of the year and are starting to approach levels compatible with normal growth. The assessment is thus that economic activity will not weaken much more.", "page_number": 16}, {"type": "text", "content": "The economic situation \n24 Figure 15. GDP gap and demand in the business sector Per cent (left), standard deviation (right) \n Note. GDP gap refers to the deviation from the Riksbank’s assessed long-term trend. The RU indicator is a statistical measure of resource utilisation. The RU indicator and demand situation in the business sector are both normalised so that the mean value is 0 and the standard deviation is 1. Sources: National Institute of Economic Research, Statistics Sweden and the Riksbank. ANALYSIS – Microdata gives insights into how companies adjust their prices One way of gaining an understanding of how companies adjust their prices is to investigate how often and by how much prices change for products included in the consumer price index (CPI). The results show that it is primarily the frequency, and not the magnitude, of price changes that correlates with the rate of inflation. This was evident in 2022 and 2023, when inflation was high. At that time, companies increased their prices much more frequently than before, while the average size of price changes did not change much. As inflation has fallen, companies have also started to change their prices less frequently. This indicates that pricing behaviour is now more in line with what it was before the period of high inflation. To understand what affects inflation, it is important to understand how companies set their prices and whether and, if so, how this changes under different economic circumstances.", "page_number": 17}, {"type": "text", "content": "There are studies indicating that the pass-through to consumer prices", "page_number": 17}, {"type": "text", "content": "The economic situation \n25 from companies’ changed costs is greater when inflation and demand are high.13 Such changes in companies’ costs could, for example, be changes in the prices of their input goods or wage costs.  A study by the National Institute of Economic Research (NIER) showed that Swedish companies, on average, raised their prices in line with how their costs rose in the period from 2019 to the second quarter of 2023.14 Historically, however, companies have tended to even out price changes and allow part of their cost changes to be absorbed by profit margins, but this did not occur during the period of rising inflation in 2022 and 2023. This indicates that this part of companies’ price-setting behaviour changed during the period of high inflation. Here, we study another aspect of companies’ price-setting behaviour, namely by how much and how often companies change their prices. Using a large data set, we have studied in detail how prices change for the products included in the consumer price index (CPI).15 Figure 16 shows that the gap between the frequency of price rises and that of price reductions increased strongly during the period of high inflation but that, as of the start of 2024, it seems to have been at about the same level as it was before inflation started to rise. The development in the high inflation period was thus primarily driven by an upswing in how often companies raised their prices. In contrast, the development of the average size of price movements was relatively stable and did not change particularly much.16 17 \n 13 See, for instance, C. Borio, M. Lombardi, J. Yetman and E. Zakrajšek (2023), “The two-regime view of inflation”, BIS papers No 133, Bank for International Settlements. 14 National Institute of Economic Research, “Prissättning hos svenska företag 2023” (Pricing among Swedish companies in 2023), special study, National Institute of Economic Research (2023). 15 For a more detailed examination, see M. Klein, K. Strömberg and O. Tysklind (2024), “Inflation dynamics in the high inflation period: insights from new micro data”, Economic Commentaries, no. 14, Sveriges Riksbank.", "page_number": 18}, {"type": "text", "content": "16 The aggregate price level in the CPI is calculated on the basis of a large number of collected prices and it thus depends on both how often and by how much prices are adjusted. The data set used covers about 75 per cent of the total weight of the CPI and includes about 9 million price observations from 2010 on. The material allows the prices of individual products to be followed month by month to see if they change and, if so, by how much. From there, product and product group weights can be used to create aggregate mea-sures of the frequency of price increases and decreases, and measures of the magnitude of price changes. 17 These results are in line with similar studies in other countries. See, for example, the article “Analyzing businesses’ price-setting behaviour” in Bank of Canada’s Monetary Policy Report from April 2024. The result is also in line with how companies in the Riksbank’s Business Survey responded in 2022, when they reported that they were adjusting prices more frequently than usual. Similar results have emerged from surveys in other countries, such as this one at CEPR: Price-setting in a high-inflation environment.", "page_number": 18}, {"type": "text", "content": "The economic situation \n26 Figure 16. Aggregate price change rate over 12 months and relative frequency and size of price changes Annual percentage change (CPIF) and percentage points (frequency and size) \n Note. The CPIF excluding energy (PRISMA) is based on the CPIF excluding energy, where the components not included in the microdata have been excluded. The relative frequency and magnitude of price changes compared with the previous month are expressed as 12-month moving averages. This is to match the annual percentage change. Sources: Statistics Sweden and the Riksbank. The same pattern can be seen when the subgroups food and other goods are examined in the CPI. However, for services prices the relationships are different. Among services prices, the rate of price increase remains high and companies are changing their prices more frequently than usual.18 Municipal taxes and rents are examples of service prices that have increased more than usual. This is assessed to be primarily due to the cost increases that took place in 2022 and 2023, rather than the demand and cost developments taking place presently. As inflation has become normalised, so too has the frequency of price changes. One lesson that can be learned for the future is that it is important to spot early signs that companies are starting to adjust their prices more frequently during periods of major changes in costs and high demand. One source of such information, for example, could be the Riksbank’s own Business Surveys. Early in 2022, companies in the Survey stated that they were adjusting prices more frequently than usual and that it was easier than usual to gain acceptance from customers for increased prices.19 \n 18 M. Klein, E. Skeppås and O. Tysklind, “Price changes on goods and services during the high inflation period: insights from microdata”, Economic Commentaries, no. 15, Sveriges Riksbank (2024). 19 See, for example, “I’ve never before experienced customers accepting price increases so easily”, Riksbank’s Business Survey, February 2022, Sveriges Riksbank.", "page_number": 19}, {"type": "text", "content": "The economic situation \n27 1.4 Swedish inflation Inflation continuing to fall Since the forecast in the Monetary Policy Report in June, inflation has fallen slightly more than expected. In August, CPIF inflation was 1.2 per cent (see Figure 5). This can largely be explained by the weak development of energy prices. Excluding energy, inflation was 2.2 per cent in August and measured as a three or six-month change calculated as an annual rate it has been close to two per cent since the start of 2024 (see Figure 17).  Figure 17. CPIF excluding energy Annual percentage change and three and six-month change calculated in annualised terms \n Note. Seasonally adjusted data. Sources: Statistics Sweden and the Riksbank. The Riksbank also analyses different measures of underlying inflation, which excludes or reduces the significance of prices that vary sharply.20 These measures have fallen significantly both annualised and especially as monthly changes (see Figure 18). \n 20 For more information on different measures of underlying inflation, see the Riksbank’s website: https://www.riksbank.se/sv/statistik/makroindikatorer/underliggande-inflation/.", "page_number": 20}]