[{"type": "text", "content": "The economic situation  \n14 Figure 4.  Unemployment and the employment rate abroad  \nPercentage of the labour force (left) and percentage of the population (r ight)  \n \nNote. Seasonally adjusted data. Unemployment and the employment rate among those aged \n15–74 in Sweden and the euro area, and those aged 16 and older for the United States.  \nSources: Eurostat, Statistics  Sweden and the US Bureau of Labor Statistics.  \nInflation is on the way down but inflation in service prices is still high  \nIn August, HICP inflation in the euro area fell to 2.2 per cent. The downturn can largely \nbe explained by a lower rate of increase in energy prices (see Figure 5). Since the end \nof last year, the annual rate of increase for services prices has been at around 4 per \ncent, which is substantially higher than normal (see Figure 6).5 Agreed wage increases \nin the euro area slowed down during  the second quarter but, in several countries, \nwages are still rising at a relatively rapid pace, which contributes to maintaining the \nrate of increase in service prices. This includes Germany.  \nIn the United States, CPI inflation has continued to fall and  was 2.5 per cent in August. \nOne reason for this is the lower rate of increase for energy prices, as well as the \nslower increase of services prices excluding rents and energy in recent months at the \nsame time as the rate of increase in prices for goods has  remained low. Moreover, \nother prices are now increasing at a more moderate pace. In terms of the PCE, \ninflation was 2.5 per cent in July.6 US wage growth has slowed down over the last \nyear. In addition, commodity prices have fallen on the world market and  inflation \nexpecta tions have slowed down in both the euro area and United States. This \nsuggests lower inflationary pressures in the period ahead.  \n \n5 The average annual change in services prices since January 2000 is 2.1 per cent in the euro area, 3.0 per \ncent in the United States and 2.3 per cent in Sweden.  \n6 PCE is the Federal Reserve’s preferred measure of inflation. Rents have a lower weighting in this measure \nthan i n the CPI.", "page_number": 1}, {"type": "text", "content": "See the fact box “The difference between the measures CPI and PCE in the United States” in \nthe Monetary Policy Report March 2024, Sveriges Riksbank, for a description of the differences between \nthe CPI and PCE measures.", "page_number": 1}, {"type": "text", "content": "The economic situation  \n15 Figure 5.  Consumer prices in various countries and regions  \nAnnual percentage change  \n \nNote. Refers to the CPIF for Sweden, the HICP for the euro area and the CPI for the United \nStates.  \nSources: Statistics Sweden, Eurostat and US Bureau of Labor Statistics.  \nFigure 6.  Prices of goods and services abroad  \nAnnual percentage ch ange  \n \nNote. Refers to the CPIF for Sweden, the HICP for the euro area and the CPI for the United \nStates.  \nSources: Eurostat , Statistics Sweden, US Bureau of Labor Statistics  and the Riksbank .", "page_number": 2}, {"type": "text", "content": "The economic situation  \n16 1.2 Financial condi tions  \nECB and Federal Reserve cut their policy rates in September   \nFollowing the rapid increases in policy rates, most central banks around the world are \nin a situation where they are now gradually easing their monetary policy, even if \ninterest rate levels  are still contractionary (see Figure 7). On 12 September, the ECB \ncut its deposit rate by 0.25 percentage points, to 3.5 per cent.7 The ECB emphasises \nthat it is unwilling to commit to a certain interest rate path in advance and that \ninterest rate decisio ns will be taken on a meeting by meeting basis.  \nThe Federal Reserve cut its policy rate on 18 September for the first time since March \n2020. At its meeting, the target interval for the Fe deral funds rate was cut by 0.5  per-\ncentage points to 4.75 -5.00  per cent . The central bank communicated that the upside \nrisks for inflation have declined and that the downside risks for the labour market \nhave increased, and that it is therefore appropriate to begin easing monetary policy to \navoid an overly weak economic de velopment. The Federal Reserve emphasises that \nthey are not following a predetermined interest rate path, but will take decisions one \nmeeting at a time. The FOMC members’ own assessments of the future policy rate, \nillustrated by the ‘dot -plot’, were lowere d for 2024 and 2025 and indicate a policy \nrate of 4.4 per cent before the end of the year and 3.4 per cent at the end of 2025.8  \nFigure 7.  International policy rates  \nPer cent  \n \nSources: National central bank s and the Riksbank .  \n \n7 The ECB also cut the interest rate for its lending facility and the interest rate for its main refinancing \noperations. See ECB monetary policy decision, 12 September 2024.  \n8 Refers to the mid -point for the policy rate interval. See FOMC Projections materi al, September 2024, \nFederal Open Market Committee, Federal Reserve.", "page_number": 3}, {"type": "text", "content": "The economic situation  \n17 Market expectations of international policy rates have fallen again  \nAt the beginning of the year, there were widespread expectations that central banks \nabroad would cut their policy rates several times over the year. During the spring, \nthese expectations were reversed, largely due to surprisingly high inflation outcomes \nand stronger economic activity. Over the summer, market expectations have shifted \ndown again apace with clearer signs of lower inflation outcomes and economic slow -\ndown. The expectations of  the Federal Reserve’s monetary policy have varied \nsubstantially, with market pricing having shifted several times in response to new \neconomic outcomes.  \nAccording to the pricing of futures contracts for short -term money market rates, \nmarket participants ex pect the Federal Reserve to cu t the policy rate by around \n1.7 percentage points until the middle of next year. For the ECB, expectations of rate \ncuts are somewhat lower. The ECB is expected to cut  the deposit rate by around \n1.3 percentage points over the s ame time period (see Figure 8).  \nFigure 8.  Market expectations of policy rates in the future  \nPer cent  \n \nNote. The figure shows policy rates and market -based expectations according to forward \npricing (Nelson -Siegel (1994)). Solid lines repre sent expectations on 23 September 2024. \nDashed lines represent expectations immediately prior to the Monetary Policy Update in \nAugust.  \nSources: National central banks and the Riksbank.  \nMarket rates at both short and longer maturities have fallen slight ly  \nSince the Monetary Policy Update in August, both short and long -term government \nbond yields and yields on higher -risk bonds have fallen slightly in Sweden, the euro \narea and the United States (see Figure 9). In the euro area and United States, the yiel d \nspread between risky bonds and swap rates increased temporarily in conjunction with \nthe financial turbulence at the start of August.9 Even though monetary policy remains \n \n9 Risky bonds refers to covered bonds, municipal bonds and corporate bonds, for example.", "page_number": 4}, {"type": "text", "content": "The economic situation  \n18 contractionary, the shrinking yield spreads are making it easier for banks and compa -\nnies, for example, to obtain funding on the market. The global financial conditions can \nchange rapidly, however. One example of this was the market turbulence observed at \nthe beginning of August, when for instance yen -financed carry -trades were rapidly \nsettled.  \nFigure 9.  Government bond yields and stock market movements in Sweden, the \neuro area and US  \nPer cent (left) and index, 27 June 2024 = 100 (right)  \n \nNote. The left -hand figure refers to zero coupon rates for Sweden and Germany, as well as \nbenchmark rates for the United States.  \nSources: Macrobond and the Riksbank.  \nStock markets have also continued to develop strongly and have recovered from the \ndownturn  at the start of August (see Figure 9). Measured using the VIX index for the \nUnited States and Germany, volatility on the stock market is lower today, overall, than \nit was during the summer. Indicators measuring financial stress on the markets are \nalso at low levels.  \nLower lending and deposit rates for households and companies  \nAs the Riksbank has cut its policy rate, the interest rates faced by households and \ncompanies have also fallen. Since the start of the year, the average mortgage rate on \nnew loans ha s fallen by about as much as the Riksbank has so far cut the policy rate \n(see Figure 10).10 For mortgage rates on loans with a longer maturity that also include \nexpectations of lower interest rates going forward, mortgage rates have fallen more \nthan the pol icy rate, however (see Figure 11). For instance, the average rate on new \nmortgages with a fixed interest period of between one and three years has fallen by \naround one percentage point since the beginning of 2024. In the corporate sector too, \n \n10 Based on Statistics Sweden's financial market statistics until the end of July and the banks’ pu blished \naverage interest rates in August.", "page_number": 5}, {"type": "text", "content": "The economic situation  \n19 all industrie s are facing a lower interest rate on their outstanding bank loans (see \nFigure 10).  \nThe deposit rate has also fallen, although not by as much as the average lending rates. \nWhen the policy rate is cut, deposit rates usually fall by less than lending rates.  This is \npartly because competition for deposits is relatively high, not least from other finan -\ncial instruments in which depositors can invest their liquidity. The transmission from \nthe policy rate to the interest rates met by households and companies is following \nhistorical patterns and working well.  \nFigure 10.  Average lending and deposit rates to households and companies and the \nRiksbank’s policy rate  \nPer cent  \n \nNote. Volume -weighted averages of lending and deposit rates at all maturities. For households, \nthis refers to interest rates on loans from monetary financial institutions, housing credit institu -\ntions and alternative investment funds. Household lending rate refers to loans for housing \npurposes. For companies,  this refers to loans from monetary financial institutions. New loans \nalso includes renegotiated loans. The last outcome refers to July 2024.  \nSources: Statistics Sweden and the Riksbank.", "page_number": 6}, {"type": "text", "content": "The economic sit uation  \n20 Figure 11.  Average mortgage rates to households for various fixed terms  \nPer cent  \n \nNote. Refers to mortgage rates from monetary financial institutions, housing credit institutions \nand alternative investment funds. Solid lines represent ne w and renegotiated loans, dashed  \nlines represent outstanding loans . The last outcome refers to July 2024.  \nSource: Statistics Sweden.  \nCredit growth remains on low levels and housing prices are rising slowly  \nDespite the slightly lower lending rates, lending to households and companies \nremains on low levels. It is still  negative for companies (see Figure 12).11 Companies \nwithin all sectors, except for the categories “property sector – housing” and “other \nservices”, which are cutting their borrowing.  \nSince the start of the year, housing prices have risen by about 2.5 per cent. Housing \nprices are now on about the same level as before the pandemic. Even though turn -\nover on the housing market has started to recover slightly, the supply of housing has \ncontinued to increase during the year. The large supply in relation to turno ver may \nhave a restraining effect on housing prices.  \n \n11 Corporate borrowing can take place via bank loans or by the issuance of securities on the bond market. \nEven if total credit growth is negative, there are some signs that lending via the bond market in Swedish \nkronor is increasing slightly due to increased risk appetite and lower risk premiums.", "page_number": 7}, {"type": "text", "content": "The economic situation  \n21 Figure 12.  Household and corporate borrowing  \nAnnual percentage change  \n \nNote. Lending by monetary financial institutions (MFIs) to households and non -financial \ncorpor ations adjusted for reclassifications and bought and sold loans. Securities issued by non -\nfinancial companies have been adjusted for currency impact. Loans from MFIs constitute about \ntwo thirds of total lending to companies, while securities issues constit ute around a third.  \nSource: Statistics Sweden.  \nLower interest rates in the United States are supporting the appreciation \nof smaller currencies  \nThe market has continued to adjust its expectations of the development of interest \nrates in the United States  downwards. This has contributed to the further deprecia -\ntion of the dollar and has supported smaller currencies, such as the Swedish krona. \nOverall, the krona has developed in line with other small currencies and, measured in \nterms of the KIX, the krona i s at around the same level as the Monetary Policy Update \nin August (see Figure 13). In the Riksbank’s forecast, the krona is assumed to \nstrengthen in the period ahead.", "page_number": 8}, {"type": "text", "content": "The economic situation  \n22 Figure 13.  Development of a number of smaller currencies against the dollar plus \nnominal exchange r ate against KIX4  \nIndex, 1 January 2024 = 100  \n \nNote. A higher value indicates a weaker exchange rate. The KIX4 (krona index) is a weighted \naverage against the US dollar, euro, pound sterling and Norwegian krone. The dashed vertical \nlines mark the date of the Monetary Policy Update in August and the solid vertical lines mark \nthe date of the Monetary Policy Report in June.  \nSources: Macrobond Financial AB and the Riksbank.  \n1.3 Swedish real economy  \nSwedish cons umption remains weak  \nSwedish GDP decreased by 0.3 per cent during the second quarter of the year, com -\npared with the previous quarter (see Figure 3). The downturn can largely be explained \nby weak consumption and investment, while the greatest positive cont ribution came \nfrom net exports. The household savings ratio has been high and consumption has \nbeen restrained since interest rates started to be raised in 2022 (see Figure 14).12  \n \n12 See also “Households continued saving at the same time as the growth rate for mortgages increased”, \nFinancial accounts, second quarter 2024, Statistics Sweden.", "page_number": 9}, {"type": "text", "content": "The economic situation  \n23 Figure 14.  Household savings ratio  \nPercentage of disposable income  \n \nNote. Seasonally adjusted data. Households and non -profit institutions serving households \n(NPISH).  \nSources: Statistics Sweden and the Riksbank.  \nThe National Institute of Economic Research’s Economic Tendency Survey fell margin -\nally in August an d overall contributes to the view of slightly weaker development than \nthe Riksbank expected in its June forecast. However, there remain signs of future \noptimism among households. For example, their assessment of Sweden’s economy \nand their own economies in 12 months is higher than normal.  \nContinuing weak labour market  \nUnemployment has risen since the end of 2022 (see Figure 4). The low demand in the \neconomy and labour market indicators all point to the continuing relatively weak \ndevelop ment of the labour m arket in the near term. The number of redundancy \nnotices and bankruptcies is on an elevated level and the number of newly -registered \nvacancies has fallen significantly. On the other hand, recruitment plans are weakly \npositive, with the service sector in pa rticular planning new recruitment.  \nRecession close to bottom  \nResource utilisation in the Swedish economy is currently assessed  to be somewhat \nlower than normal and the economy is in mild recession. One way of estimating \nresource utilisation is to assess t he size of the gap between actual and potential levels \nfor GDP, for example, known as the GDP gap. Another indicator of resource utilisation \nis the view taken by companies of the current demand situation, which is measured \nregularly by the National Institu te of Economic Research. The Riksbank's assessment is \nthat the GDP gap is lower than normal, which corresponds well to the current demand \nsituation (see Figure 15). The Riksbank’s resource utilisation indicator, the RU indica -\ntor, which weighs together var ious indicators, also suggests that resource utilisation \nhas fallen and is marginally below normal. But indicators for growth have risen since \nthe start of the year and are starting to approach levels compatible with normal \ngrowth. The assessment is thus t hat economic activity will not weaken much more.", "page_number": 10}, {"type": "text", "content": "The economic situation  \n24 Figure 15.  GDP gap and demand in the business sector  \nPer cent (left), standard deviation (right)  \n \nNote. GDP gap refers to the deviation from the Riksbank’s assessed long -term trend. The RU \nindicator is a statistical measure of resource utilisation. The RU indicator and demand situation \nin the business sector are both normalised so that the mean value is 0 and the standard \ndeviation is 1.  \nSources: National Institute of Economic Research, Statistics Sweden and the Riksbank.  \nANALYSIS – Microdata  gives insights into how \ncompanies adjust their prices  \nOne way of gaining an understanding of how companies adjust their \nprices is to investigate how often and by how much pri ces change for \nproducts included in the consumer price index (CPI). The results show \nthat it is primarily the frequency, and not the magnitude, of price \nchanges that co rrelates  with the rate of inflation. This was evident in \n2022 and 2023, when inflation w as high. At that time, companies \nincreased their prices much more frequently than before, while the \naverage size of price changes did not change much. As inflation has \nfallen, companies have also started to change their prices less frequently. \nThis indicat es that pricing behaviour is now more in line with what it was \nbefore the period of high inflation.  \nTo understand what affects inflation, it is important to understand how companies set \ntheir prices and whether and, if so, how this changes under different economic \ncircum stances.", "page_number": 11}, {"type": "text", "content": "There are studies indicating that the pass -through to consumer prices", "page_number": 11}]